package Collections.collections.ArrayList._PriorityQueueTasks;
//Создайте PriorityQueue и добавьте 5 чисел. Выведите их в порядке удаления.
//Реализуйте очередь задач с приоритетами. Добавьте несколько задач и извлеките их по приоритету.
//Используйте PriorityQueue для сортировки объектов по приоритету.
//Реализуйте PriorityQueue, в которой можно изменять приоритет уже добавленного элемента.
//Напишите систему планирования задач, где задачи выполняются по приоритету, а при равном приоритете – по порядку добавления.
public class Main {
    public static void main(String[] args) {


    }
}
