package Collections.collections.HashSetTasks;
//Создайте HashSet из 5 чисел и выведите его содержимое.
//Добавьте в HashSet 10 случайных чисел. Проверьте, содержит ли он заданное число.
//Реализуйте метод, который принимает List<String> и возвращает Set<String> без дубликатов.
//Напишите метод, который проверяет, содержит ли HashSet все элементы из другого Set.
//Реализуйте кэш из HashSet, который автоматически удаляет старые записи через определённый интервал.
public class Main{
    public static void main(String[] args) {

    }
}
